home/models/Article.php

SELECT * FROM `yii2_article` WHERE `category_id`=3 ORDER BY `id`
---
    public static function lists($cid){
        return static::find()->where(['category_id'=>$cid])->orderBy('id ASC')->asArray()->all();