home/models/Order.php

SELECT * FROM `yii2_order` WHERE (`order_sn`='T14761757967314') AND (`pay_status`=0)
---
    public static function orderPayCallback($data){
        $info = static::findOne(['order_sn'=>$data['out_trade_no'], 'pay_status'=>0]);

SELECT FROM_UNIXTIME(start_time,"%Y-%m-%d") AS s, sum(num) AS c FROM `yii2_order` WHERE ((`type`='train_tuan') AND (`pay_status`=1) AND (`cid`='1') AND (`aid`='11')) AND (`start_time` BETWEEN 1475251200 AND 1477929600) GROUP BY `s`
---
    public static function getTrainTuanList($date, $id, $cid){
        $stime = strtotime($date.'-01');
        $etime = strtotime($date.'-01 +1 month');
        $list = static::find()->select(['FROM_UNIXTIME(start_time,"%Y-%m-%d") AS s', 'sum(num) AS c'])
            ->where(['type'=>'train_tuan', 'pay_status'=>1, 'cid'=>$cid, 'aid'=>$id])
            ->andWhere(['between', 'start_time', $stime, $etime])->groupBy('s')->asArray()->all();