home/models/PayPwdService.php

    public function modifyPassword()
    {
        if ($this->validate()){
            $user = $this->getUser();
            $user->setPayPassword($this->new_password);
            return $user->save();
---
UPDATE `yii2_user` SET `pay_pwd`='$2y$13$znUCjohq2U.9UXd0tn/k/ujEHXppEXfQnmKAc5DC6hBVPLQkv5VDi' WHERE `uid`='17'