home/models/Shop.php

SELECT * FROM `yii2_shop` WHERE `id`='6'
---
    public static function info($id)
    {
        return static::find()->where(['id'=>$id])->asArray()->one();