home/models/ShopGroup.php

    public static function info($id)
    {
        return static::find()->where(['id'=>$id])->asArray()->one();
---
SELECT * FROM `yii2_shop_group` WHERE `id`='6'