home/models/ShopPrice.php

    public static function getNickPrice($stime, $day, $shop_id) {
        $date[0] = $stime;
        if($day > 1) {
            for ($i = 1; $i < $day; $i++) {
                $date[] = $stime = date('Y-m-d',strtotime($stime)+24*60*60);
            }
        }
        //获取变动价格的天数，和总价
        $list = static::find()->where(['day'=>$date, 'shop_id'=>$shop_id])->select(['count(id) as n, sum(price) as total,price'])->asArray()->one();
---
SELECT count(id) as n, sum(price) as total,price FROM `yii2_shop_price` WHERE (`day` IN ('2016-10-01', '2016-10-02', '2016-10-03', '2016-10-04', '2016-10-05', '2016-10-06', '2016-10-07')) AND (`shop_id`='1')