home/models/Train.php

SELECT * FROM `yii2_train` WHERE `id`='11'
---
    public static function info($id)
    {
        return static::find()->where(['id'=>$id])->asArray()->one();

SELECT * FROM `yii2_train` WHERE `id`='11'
SELECT * FROM `yii2_train` WHERE `type`='1' ORDER BY `id`
---
    public static function getMax($id)
    {
        $info = static::findOne($id);
        return $info->max;

SELECT * FROM `yii2_train` WHERE `type`='1' ORDER BY `id`
---
    public static function lists($type){
        return static::find()->where(['type'=>$type])->orderBy('id ASC')->asArray()->all();