home/models/TrainType.php

SELECT * FROM `yii2_train_type` WHERE `id`='1'
---
    public static function info($type)
    {
        return static::find()->where(['id'=>$type])->asArray()->one();

SELECT * FROM `yii2_train_type` WHERE `id`='1'
---
    public static function getFieldById($id, $field='certif_ids') {
        if(!$id) return '';
        $info =  static::findOne($id);