home/models/TrainPrice.php

SELECT `price` FROM `yii2_train_price` WHERE (`train_id`='11') AND (`certif_id`='1')
---
    public static function getNickPrice($train_id, $certif_id) {
        $info = static::find()->select(['price'])->where(['train_id'=>$train_id, 'certif_id'=>$certif_id])->one();