home/models/User.php

SELECT * FROM `yii2_user` WHERE (`uid`='17') AND (`status`=1)
---
    public static function findIdentity($uid)
    {
        return static::findOne(['uid' => $uid, 'status' => self::STATUS_ACTIVE]);