common/models/RechargeLog.php

INSERT INTO `yii2_recharge_log` (`amount`, `pay_type`, `uid`, `ctime`, `order_sn`) VALUES ('0.01', 2, '17', 1475980900, 'R14759809002585')
---
    public function add(){
        if($this->validate()) {
            $this->uid = Yii::$app->user->identity->getId();
            $this->ctime = time();
            $this->order_sn = 'R'.time().rand(1000, 9999);
            return $this->save();