common/models/TrainCertificate.php

    public static function getInfo($id){
        $info = static::find()->where(['id'=>$id])->asArray()->one();
---
SELECT * FROM `yii2_train_certificate` WHERE `id`='1'

    public static function getAllByIds($ids, $format = 1) {
        if(!$ids) return '';
        $list = static::find()->where(['id' => explode(',', $ids)])->asArray()->all();
---
SELECT * FROM `yii2_train_certificate` WHERE `id` IN ('1', '2', '3')