common/models/TrainType.php

SELECT * FROM `yii2_train_type` ORDER BY `ctime` DESC
---
    public static function getAll($format = 1){
        $list = static::find()->orderBy('ctime desc')->asArray()->all();