home/modules/user/controllers/IndexController.php

    public function actionIndex()
    {
        $query = Order::find()->where(['uid'=>$this->uid, 'status'=>1]);

        $count = $query->count();

        $pagination = new Pagination(['totalCount' => $count]);
        $pagination->defaultPageSize = 10;

        $order_list = $query->offset($pagination->offset)->limit($pagination->limit)->all();
---
SELECT COUNT(*) FROM `yii2_order` WHERE (`uid`='17') AND (`status`=1)
SELECT * FROM `yii2_order` WHERE (`uid`='17') AND (`status`=1) LIMIT 10