home/modules/user/controllers/LoginController.php

SELECT * FROM `yii2_user` WHERE (`mobile`='18665354960') AND (`status`=1)
---
    public function actionLogin(){
        if (Yii::$app->request->isAjax) {
            $username = Yii::$app->request->get('username');
            $password = Yii::$app->request->get('password');
            if (!$username || !$password) {
                exit('0');
            }
            $user = [];
            /* 手机号登录 */
            $reg = '/^1[3|4|5|7|8|9]\d{9}$/';
            if (preg_match($reg, $username)) {
                $user = User::findOne(['mobile' => $username, 'status' => User::STATUS_ACTIVE]);