home/controllers/IndexController.php

SELECT * FROM `yii2_shop_group` WHERE `status`=1 ORDER BY `SORT` DESC LIMIT 3
---
    public function actionIndex()
    {
        /* 首页 套餐 幻灯片 */
        $group_ppt = ShopGroup::find()->where(['status'=>1])->orderBy('SORT asc')->limit(3)->asArray()->all();