home/controllers/OrderController.php

            $data['total'] = 0;
            $model = new Order();
            $model->setAttributes($data);
            if (!$model->save()) {
---
INSERT INTO `yii2_order` (`order_sn`, `uid`, `name`, `tel`, `sfz`, `type`, `aid`, `title`, `start_time`, `end_time`, `num`, `total`, `pay_status`, `pay_time`, `pay_type`, `pay_source`, `create_time`, `status`) VALUES ('S14751415852867', 17, 'æ’’åœ°æ–\¹', 'æ˜¯å¦', 'è‰¾ä¸å‡\¡', 'shop', 1, 'å¤§åºŠåŒäººæˆ¿ç‰¹ä»\·', 1475164800, 1475251200, 1, '520.12', 0, 0, 2, 1, 1475141585, 1)

                $title .= $data['title'];
                $model = new OrderExtend();
                $model->setAttributes($data);
                if (!$model->save()) {
---
INSERT INTO `yii2_order` (`order_sn`, `uid`, `name`, `tel`, `sfz`, `type`, `pay_status`, `pay_time`, `pay_type`, `pay_source`, `create_time`, `status`, `aid`, `title`, `start_time`, `end_time`, `num`, `total`) VALUES ('S14752334623190', 17, 'asdfasdf', 'asfasdfasdf', 'asdfasdfasdf', 'shop', 0, 0, 0, 1, 1475233462, 1, 1, '大床双人房特价大床双人房特价', 1475251200, 1475856000, 1, '4600.6')