home/controllers/OrderController.php

INSERT INTO `yii2_order` (`order_sn`, `uid`, `name`, `tel`, `sfz`, `type`, `pay_status`, `pay_time`, `pay_type`, `pay_source`, `create_time`, `status`, `aid`, `title`, `start_time`, `end_time`, `num`, `total`, `taocan`) VALUES ('S14752314097288', 17, 'asdf', 'asdf', 'asdf', 'shop', 0, 0, 0, 1, 1475231409, 1, 2, '666666æˆ\¿3å¤\©2é—´ï¼›æµ·é’“4å°æ—¶2äº\º666666æˆ\¿3å¤\©2é—´ï¼›æµ·é’“4å°æ—¶2äº\º', 1475308800, 1475323200, 2, '8368', 6)
---
                $title .= $data['title'];
                $model = new OrderExtend();
                $model->setAttributes($data);
                if (!$model->save()) {