home/controllers/PayController.php

SELECT * FROM `yii2_order` WHERE `order_sn` IN ('S14751415852867', 'S14751415854231', 'S14751415854794', 'S14751415858621')
---
    private function checkOrder($order_sn) {
        $order_sn = explode(',', $order_sn);
        if(count($order_sn) == 1) {
            $order_info = Order::findOne(['order_sn' => $order_sn]);
            if(!$order_info) {
                Yii::$app->getSession()->setFlash('error', '该订单不存在!');
                $this->redirect(Url::to(['/train/index']));
                Yii::$app->end();
            }
            if ($order_info->pay_status == 1 && $order_info->pay_time > 0) {
                Yii::$app->getSession()->setFlash('error', '该订单已经支付了哦!');
                $this->redirect(Url::to(['/train/index']));
                Yii::$app->end();
            }
        }else{
            $order_list = Order::findAll(['order_sn'=>$order_sn]);