home/controllers/TrainController.php

SELECT * FROM `yii2_order` WHERE (`order_sn`='T14749606587733') AND (`uid`='17')
---
    public function actionOrderPay(){
        $order_sn = Yii::$app->request->post('order_sn', '');
        $name = Yii::$app->request->post('name', '');
        $tel = Yii::$app->request->post('tel', '');
        $sfz = Yii::$app->request->post('sfz', '');
        $pay_type = Yii::$app->request->post('pay_type', 0);

        if(!$order_sn || !$name || !$tel || !$sfz || !$pay_type){
            Yii::$app->getSession()->setFlash('error', '参数异常');
            $this->redirect(Url::to(['/train/index']));
            Yii::$app->end();
        }
        if (Yii::$app->user->isGuest) {
            Yii::$app->getSession()->setFlash('error', '请先登录');
            $this->redirect(Url::to(['/train/index']));
            Yii::$app->end();
        }
        $uid = Yii::$app->user->identity->getId();
        $model = Order::findOne(['order_sn'=>$order_sn, 'uid'=>$uid]);