backend/models/Shop.php

    public static function lists($type = 0){
        $arr = [];
        $typeArr = ShopType::find()->orderBy('id ASC')->asArray()->all();
        if (!$typeArr) {
            return false;
        }
        foreach ($typeArr as $value) {
            $_tmp = static::find()->where(['type'=>$value['id']])->orderBy('id ASC')->asArray()->all();
---
SELECT * FROM `yii2_shop_type` ORDER BY `id`
SELECT * FROM `yii2_shop` WHERE `type`='1' ORDER BY `id`